---
kind: type
id: T:Autodesk.Revit.DB.GridNode
source: html/231a5e2c-a18a-7710-a514-b320c4a2cc70.htm
---
# Autodesk.Revit.DB.GridNode

A structure that represents a particular location in (U,V) from a grid.

## Syntax (C#)
```csharp
public struct GridNode
```